zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam0/include/same54/instance/evsys.h
// USERS
#define EVSYS_ID_USER_RTC_TAMPER    0
#define EVSYS_ID_USER_PORT_EV_0     1
#define EVSYS_ID_USER_PORT_EV_1     2
#define EVSYS_ID_USER_PORT_EV_2     3
#define EVSYS_ID_USER_PORT_EV_3     4
#define EVSYS_ID_USER_DMAC_CH_0     5
#define EVSYS_ID_USER_DMAC_CH_1     6
#define EVSYS_ID_USER_DMAC_CH_2     7
#define EVSYS_ID_USER_DMAC_CH_3     8
#define EVSYS_ID_USER_DMAC_CH_4     9
#define EVSYS_ID_USER_DMAC_CH_5     10
#define EVSYS_ID_USER_DMAC_CH_6     11
#define EVSYS_ID_USER_DMAC_CH_7     12
#define EVSYS_ID_USER_CM4_TRACE_START 14
#define EVSYS_ID_USER_CM4_TRACE_STOP 15
#define EVSYS_ID_USER_CM4_TRACE_TRIG 16
#define EVSYS_ID_USER_TCC0_EV_0     17
#define EVSYS_ID_USER_TCC0_EV_1     18
#define EVSYS_ID_USER_TCC0_MC_0     19
#define EVSYS_ID_USER_TCC0_MC_1     20
#define EVSYS_ID_USER_TCC0_MC_2     21
#define EVSYS_ID_USER_TCC0_MC_3     22
#define EVSYS_ID_USER_TCC0_MC_4     23
#define EVSYS_ID_USER_TCC0_MC_5     24
#define EVSYS_ID_USER_TCC1_EV_0     25
#define EVSYS_ID_USER_TCC1_EV_1     26
#define EVSYS_ID_USER_TCC1_MC_0     27
#define EVSYS_ID_USER_TCC1_MC_1     28
#define EVSYS_ID_USER_TCC1_MC_2     29
#define EVSYS_ID_USER_TCC1_MC_3     30
#define EVSYS_ID_USER_TCC2_EV_0     31
#define EVSYS_ID_USER_TCC2_EV_1     32
#define EVSYS_ID_USER_TCC2_MC_0     33
#define EVSYS_ID_USER_TCC2_MC_1     34
#define EVSYS_ID_USER_TCC2_MC_2     35
#define EVSYS_ID_USER_TCC3_EV_0     36
#define EVSYS_ID_USER_TCC3_EV_1     37
#define EVSYS_ID_USER_TCC3_MC_0     38
#define EVSYS_ID_USER_TCC3_MC_1     39
#define EVSYS_ID_USER_TCC4_EV_0     40
#define EVSYS_ID_USER_TCC4_EV_1     41
#define EVSYS_ID_USER_TCC4_MC_0     42
#define EVSYS_ID_USER_TCC4_MC_1     43
#define EVSYS_ID_USER_TC0_EVU       44
#define EVSYS_ID_USER_TC1_EVU       45
#define EVSYS_ID_USER_TC2_EVU       46
#define EVSYS_ID_USER_TC3_EVU       47
#define EVSYS_ID_USER_TC4_EVU       48
#define EVSYS_ID_USER_TC5_EVU       49
#define EVSYS_ID_USER_TC6_EVU       50
#define EVSYS_ID_USER_TC7_EVU       51
#define EVSYS_ID_USER_PDEC_EVU_0    52
#define EVSYS_ID_USER_PDEC_EVU_1    53
#define EVSYS_ID_USER_PDEC_EVU_2    54
#define EVSYS_ID_USER_ADC0_START    55
#define EVSYS_ID_USER_ADC0_SYNC     56
#define EVSYS_ID_USER_ADC1_START    57
#define EVSYS_ID_USER_ADC1_SYNC     58
#define EVSYS_ID_USER_AC_SOC_0      59
#define EVSYS_ID_USER_AC_SOC_1      60
#define EVSYS_ID_USER_DAC_START_0   61
#define EVSYS_ID_USER_DAC_START_1   62
#define EVSYS_ID_USER_CCL_LUTIN_0   63
#define EVSYS_ID_USER_CCL_LUTIN_1   64
#define EVSYS_ID_USER_CCL_LUTIN_2   65
#define EVSYS_ID_USER_CCL_LUTIN_3   66

#endif /* _SAME54_EVSYS_INSTANCE_ */
